HTML_and_CSS_Design_and_Build_Websites/004.Links/004.000.Notes.org
#+title: Chapter 4: Links
#+author: Alfredo Mejia
#+options: num:nil html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /> <style>body {margin: 5%} h1,h2,h3,h4,h5,h6 {margin-top: 3%}</style>

* Navigation                                                                                                                                                                                                          
| Nav   | Title                                  | Links                                   |
|-------+----------------------------------------+-----------------------------------------|
| Index | Notes Home                             | \vert [[file:../../index.html][html]] \vert [[file:../../index.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main][github]] \vert |
| Home  | HTML & CSS - Design and Build Websites | \vert [[file:../000.Home.html][html]] \vert [[file:../000.Home.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites][github]] \vert |
| Prev  | Chapter 3: Lists                       | \vert [[file:../003.Lists/003.000.Notes.html][html]] \vert [[file:../003.Lists/003.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/003.Lists][github]] \vert |
| Next  | Chapter 5: Images                      | \vert [[file:../005.Images/005.000.Notes.html][html]] \vert [[file:../005.Images/005.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/005.Images][github]] \vert |

* Notes

** Section 4.1: Introduction to Links
   - Links are the defining feature of the web because they allow you to move from one web page to another, thus enabling the very idea of browsing or surfing
   - Links are used in different ways: one website to another, one page to another within the same website, links to a section within the same page, links that open in a new tab, links that open your email app and address a new email to someone, etc
   - Links are created using the ~<a>~ element and anything can be specified within the opening and closing tags
   - So how does it know where to "link" to? Well, it uses the ~href~ attribute and using that attribute you enter the URL where you want the link to direct you to
   - The content inside the element is called the link text and should specify to the users where they will be taken if they click on it (instead of just saying "click here")
   - Good link text can help people with screen readers and give a good impression of your website so to write good link text you can think of words people use when searching for the page that you are linking to
   - For example, if you have a link of the fastest cars then the link text could say "fastest cars in the world" (something people would search for the page I am directing them to)

** Section 4.2: Linking to Other Sites & Linking to Other Pages On The Same Site
   - Users can click on anything that appears between the opening (~<a>~) and closing (~</a>~) tags
   - When you link to a /different/ website, the value of the ~href~ attribute will be the full web address for the site, which is known as an absolute URL
   - URL stands for Uniform Resource Locator and every web page has its own URL
   - An absolute URL starts with the domain name for that site followed by the path to a specific page and if no specific page is specified it will default to the home page of the domain (note you'll still need to include ~http~ and depending also ~www~)
   - When you are linking to another page within the same site you don't need to specify the absolute URL instead you can specify the relative URL
   - Relative URLs use a short-form syntax to be able to indicate where the page is relative to the current page; this way it is easier to do linking without using the domain
   - It is often a good idea to organize your code by placing pages for each different section of the site into a new folder
   - Normally, each section has a homepage called ~index.html~ because web servers are usally set up to return the ~index.html~ file if no file name is specified thus if you have a folder called movies then if the URL is typed as /domian.com/movies then it will return ~index.html~ in the movies folder
   - To indicate the current directory you use ~./~ and to indicate a parent directory you use ~../~ for relative urls, so for example if you need to go to your grandparent's folder and select a file you will do something like ~../../index.html~

** Section 4.3: Email Links & Opening Links in a New Window
   - To create a link that starts up the user's email program and addresses an email to a specified email address you use the same ~<a>~ element and the same ~href~ attribute
   - However, this time the value of the ~href~ attribute starts with ~mailto:~ followed by the email address you want the email to be sent to
   - Thus it will appear as a link but when clicked the user's email program will open a new email message and address it to the person specified in the link
   - If you want a link to open in a new window (tap), you can use the ~target~ attribute on the opening ~<a>~ tag and the value should be ~_blank~
   - Generally the blank value is used because the web page author want the user to return to their web page and if we do we should inform the users that the link will open a new window (tab) before they click on it

** Section 4.4: Linking to a Specific Part of the Same Page
   - Many people create links within the same page to allow the users to be able to navigate a long page easily
   - Before you can link to a specific part of a page, you need to identify the points in the page that the link will go to and you do this by using the ~id~ attribute which is a global attribute (it works on every HTML element)
   - The value of the ~id~ attribute should start with a letter or an underscore (not a number or any other character) and on a single page no two ~id~ attributes should have the same value
   - To link to an element that uses an ~id~ attribute you use the same ~<a>~ element and the same ~href~ tag but now the value of ~href~ starts with the ~#~ symbol followed by the value of the ~id~ attribute of the element you want to link to

** Section 4.5: Linking to a Specific Part of Another Page
   - A similar approach used to link to a specific part (element) of another page
   - As long as that page uses the ~id~ attributes and the web author knows the value again as the ~id~ you can simply give the ~href~ attribute the value of the path to the page followed by ~#~ and the ~id~ attribute value
   - Therefore, the href attribute will contain the address for the page (either by using absolute URL or relative URL) followed by the ~#~ symbol followed by the value of the ~id~ attribute that is used on the element you are linking to
   - Here is an example:

   #+BEGIN_SRC html
     <a href="http:/www.htmlandcssbook.com/#bottom">Example</a>
   #+END_SRC

** Section 4.6: Creating a Simple Web Page With Links
   - [[file:./004.006.Creating a Simple Web Page With Links/index.html][Completed creating a simple web page with links exercise]]
     
* Keywords
| Term                  | Definition                                                                                                        |
|-----------------------+-------------------------------------------------------------------------------------------------------------------|
| *HTML Anchor Element* | The ~<a>~ element is used to create links to different web pages and can even be used to send an email            |
| *Link Text*           | The text in between the opening and closing tags of the anchor element                                            |
| *URL*                 | Unifrom Resource Locator which is a unique path to a resource                                                     |
| *Absolute URL*        | An URL that has the domain and the path to the resource                                                           |
| *Relative URL*        | An URL that is relative to the current page and thus describes the path relative to the current working directory |
| *ID Attribute*        | A global attribute that can be used on any HTML element to identify a specific HTML element                       |

* Questions
  - *Q*: According to the book we should avoid opening links in a new window. Is it still the case?
         - [[https://ux.stackexchange.com/questions/104154/should-external-link-open-in-same-tab-or-new-tab][UX StackExchange Explanation]]
	 - The general consensus is that a new tab *should not* be opened
	 - Generally, we should open links within the same tab for various reasons:
	   1. Screen readers and users using accessibility software may get lost and disoriented
	   2. Not every user are tech savy and thus do not always work with tabs or understand how to use tabs
	   3. Your back button does not work anymore and many people navigate the web using the back button
	   4. Mobile usage becomes more cumbersome 
         - So only if need should you open a new tab but like the book says: it should generally be avoided
	   
* Summary
  - The anchor element along with the ~href~ attribute is used to specify link text and the URL to the resource you are linking it to
  - If you are linking to another site then use the absolute URL but if you are linking another page within your site it is best to use a relative URL
  - You can also send emails with the anchor element and the ~href~ attribute
  - You can specify if you want the link to open within the same tab or in a new tab
  - You can also link to a specific part (element) of a page either within the same page or another page
  - This is done by simply adding an id attribute to the HTML element you want to link to and specifying in the ~href~ attribute the ~#~ followed by the name of the id
  - If it is within the same page just specify using the ~#~ symbol and the id name but if it is a different page then specify the URL followed by ~#~ and the name of the id
